/*
 * Project Euler - Problem 230
 * Source: http://odz.sakura.ne.jp/projecteuler/index.php?cmd=read&page=Problem%20230
 * 
 * Problem 230 「フィボナッチ列」  †
 * 任意の2つの数字列 A,B に対し, FA,Bを (A,B,AB,BAB,ABBAB,...) という数列で定義する.
 * 各項は前の２つの項をつなげたものである.
 * さらに DA,B(n) を FA,B の中で少なくとも n 桁ある最初の項の, n 桁目の数字と定義する.
 * 例:
 * A=1415926535, B=8979323846 とする. ここで DA,B(35) を求めたい.
 * FA,B の最初の数項は以下の通り:
 * 1415926535
 * 8979323846
 * 14159265358979323846
 * 897932384614159265358979323846
 * 14159265358979323846897932384614159265358979323846
 * DA,B(35) は 5項目の 35番目の数字となり, 9 である.
 * A を円周率πの小数点に続く100桁とする.
 * 14159265358979323846264338327950288419716939937510
 * 58209749445923078164062862089986280348253421170679
 * Bをさらに続く100桁とする.
 * 82148086513282306647093844609550582231725359408128
 * 48111745028410270193852110555964462294895493038196
 * Σn=0,1,...,1710n× DA,B((127+19n)×7n)を求めよ.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <stdbool.h>

int main() {
    printf("Project Euler - Problem 230\n");
    
    // TODO: Implement solution here
    
    return 0;
}
