/*
 * Project Euler - Problem 399
 * Source: http://odz.sakura.ne.jp/projecteuler/index.php?cmd=read&page=Problem%20399
 * 
 * Problem 399 「無平方フィボナッチ数」  †
 * 最初の15個のフィボナッチ数は以下のとおりである:
 * 1,1,2,3,5,8,13,21,34,55,89,144,233,377,610.
 * 8 と 144 は無平方 (squarefree) ではないことがわかるだろう: 8 は 4 で, 144 は 4 と 9 で割ることができる.
 * つまり最初の13個の無平方フィボナッチ数は以下のようになる:
 * 1,1,2,3,5,13,21,34,55,89,233,377,610.
 * 200番目の無平方フィボナッチ数は:
 * 971183874599339129547649988289594072811608739584170445.
 * この数の末尾16桁は: 1608739584170445 であり, また科学的記数法でこの数は 9.7e53 と表せる.
 * 100 000 000番目の無平方フィボナッチ数を求めよ.
 * 回答は末尾16桁の後にコンマをつけ, 更にその数を科学的記数法で表したもの(仮数部を小数点以下2桁目で四捨五入したもの)を続けよ.
 * 200番目の無平方フィボナッチ数の場合, 答えるべき回答は以下のようになる: 1608739584170445,9.7e53
 * 注記 :
 * この問題では, すべての素数 p において, p で割ることができる最初のフィボナッチ数は p2 で割ることができないと仮定している
 * (これはウォール予想 (Wall's conjecture) の一部である). この仮定は 3·1015 までの素数については確かめられているが,
 * 一般には未解決とされている.
 * もしこの予想が偽であった場合, この問題の想定回答は100 000 000番目の無平方フィボナッチ数である保障はなく,
 * 正確に言えばそのような数の下限を示すのみとなる.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <stdbool.h>

int main() {
    printf("Project Euler - Problem 399\n");
    
    // TODO: Implement solution here
    
    return 0;
}
