/*
 * Project Euler - Problem 253
 * Source: http://odz.sakura.ne.jp/projecteuler/index.php?cmd=read&page=Problem%20253
 * 
 * Problem 253 「お片づけ」  †
 * 小さい子供が"数字イモムシ"を持っている. これは 40 のジグソーピースからなり, それぞれのピースは 1 つ数字が書いてあり,
 * 一列につなげると 1 から 40 まで順番に並ぶ.
 * 毎夜, 子供の父親は遊戯室にばらまかれたイモムシのピースを拾い集めなければならない. 父親は無作為にピースを拾っていき, 正しい順序に並べていく.
 * このようにイモムシを組み立てていくと, 徐々にくっついていっていくつかの断片が出来上がっていく.
 * 断片の数は0(何もない状態)から始まり, だいたい 11 か 12 まで増えた後, やがてまた減っていき 1 (全部くっついた状態)で終わる.
 * 例えば,
 * 置かれたピース現時点の断片
 * 121
 * 42
 * 293
 * 64
 * 345
 * 54
 * 354
 * ......
 * M を無作為にイモムシを片づける過程で起こった最大の断片の数とする.
 * 10 ピースのイモムシの場合では, 各 M が起こる場合の数は
 * M場合の数
 * 1512
 * 2250912
 * 31815264
 * 41418112
 * 5144000
 * つまり M の最頻値は 3 で平均値は &sup{385643};/&sub{113400}; = 3.400732
 * である(小数点以下6桁に四捨五入).
 * 40 ピースのイモムシの場合は M の最頻値は 11 である. では M の平均値は?
 * 小数点以下6桁に四捨五入し回答せよ.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <stdbool.h>

int main() {
    printf("Project Euler - Problem 253\n");
    
    // TODO: Implement solution here
    
    return 0;
}
