/*
 * Project Euler - Problem 314
 * Source: http://odz.sakura.ne.jp/projecteuler/index.php?cmd=read&page=Problem%20314
 * 
 * Problem 314 「小鼠 月世界を征服」  †
 * 月が開拓され, 土地はただで手に入るようになったが, 困ったことがある. 確保した土地の周りに壁を作らなければならないのだが,
 * 月に壁を作るにはお金がかかるのだ. 各国には 500 m × 500 m の正方形の土地が割り当てられているが,
 * 壁の内側にある領域だけ保有することになる. 251001 本の杭が１メートル間隔で格子状に設置されている. 壁は閉じた一つながりの直線であり,
 * 各直線は杭どうしを結んでいなければならない.
 * 大きな国はもちろん 250 000 m&sup{2}; の土地全体を囲うよう 2000 m の壁を建てた.
 * グランドフェンウィック大公国は予算が厳しく, あなた（皇室プログラマ）に, 囲われた面積／壁の長さ
 * の比が最大となる形はどのようなものか計算するよう依頼した.
 * あなたは紙の上で予備計算を行った. 2000 メートルの壁で 250 000 m&sup{2}; の土地を囲うと, 囲われた面積／壁の長さの比は
 * 125 となる.
 * 認められてはいないが, いくらか良いかもしれないアイデアを試してみよう：正方形の内部に, 四辺に接するように円を置けば, 面積は
 * π*250&sup{2}; m&sup{2}; に等しく, 周囲の長さは π*500 m となり, したがって囲われた面積／壁の長さの比はこれも
 * 125 となる.
 * しかしながら, 三辺が 75 m, 75 m, 75√2 m の三角形を四つ正方形から切り離すと, 総面積は 238750 m&sup{2};
 * で, 周囲の長さは 1400+300√2 m となる. したがって囲われた面積／壁の長さの比は 130.87 と著しく良くなる.
 * 囲われた面積／壁の長さの比の最大値を求めよ.
 * 答えを小数第９位で四捨五入し abc.defghijk の形で答えよ.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <stdbool.h>

int main() {
    printf("Project Euler - Problem 314\n");
    
    // TODO: Implement solution here
    
    return 0;
}
