/*
 * Project Euler - Problem 431
 * Source: http://odz.sakura.ne.jp/projecteuler/index.php?cmd=read&page=Problem%20431
 * 
 * Problem 431 「平方空間サイロ」  †
 * 農場経営者のフレッドは農場に新しいサイロを設営する準備中で, また円形のものを見つけたときは腰を抜かすほど,
 * 四角いものに対する強迫観念を持っている. 設営するサイロの会社代表クエンティンは我々は円筒状のサイロしか作っていないと説明し,
 * 四角い土台の上に乗ってはいると指摘. フレッドは憮然とし, それは私の個性を否定するようなものだと言い張る.
 * クエンティンは機転を利かせ, サイロに粒上のものが上から供給されるとき, 円錐状の斜面が形作られ,
 * 自然に作られる斜面の水平線からの角度は安息角と呼ばれると説明する. 例えば安息角が α = 30 度の場合,
 * そしてサイロの中央から穀物が供給された時, 円柱の最上部に向かって完全な円錐が形作られる. このサイロの場合直径は6mなので,
 * 無駄な空間の体積はおよそ 32.648388556 m3 になる. その一方, もし穀物が中心から x
 * メートル水平に離れた最上面の点から供給される場合, 奇妙にカーブし傾斜した底面からなる円錐となる. 彼はフレッドに図を見せる.
 * 無駄なスペースの体積を, 単位を立方メートルとして V(x) で表すとしよう. もし x = 1.114785284 のとき,
 * ちなみにこれは偶然にも3の自乗, すなわち小数点以下9桁の有効数字を持つ, このとき無駄な空間の体積は V(1.114785284) ≈ 36
 * となる. この問題で与えられている可能な回答の範囲ではもうひとつの選択肢がある: V(2.511167869) ≈ 49.
 * こうして平方数はサイロの王様として, 穀物の円錐の頂上に燦然と輝くであろう.
 * フレッドの目はこのエレガントな解決法に喜び輝いた. しかしクエンティンの図と計算についてさらによく調べてみると, 彼の喜びは再び落胆に変わる.
 * フレッドは設営予定のサイロは直径ではなく半径が6mで, さらに彼の穀物の安息角は40度であると指摘.
 * しかしながらもしクエンティンが今回のサイロに対する解決策一式を見つけることができれば, 落胆することなくより幸せになれるだろう.
 * もし機転を利かせてクエンティンが苛立たしいほど細かい農場経営者フレッドの四角に対する欲求を満足させようとする場合,
 * 無駄な空間が平方数となるすべての x の値を決定し, Σx を小数点以下9桁まで計算せよ.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <stdbool.h>

int main() {
    printf("Project Euler - Problem 431\n");
    
    // TODO: Implement solution here
    
    return 0;
}
