/*
 * Project Euler - Problem 499
 * Source: http://odz.sakura.ne.jp/projecteuler/index.php?cmd=read&page=Problem%20499
 * 
 * Problem 499 「サンクトペテルブルグの賭け」  †
 * 博打打ちがある特別な賭けに参加することを決めた.
 * この賭けでは, 博打打ちは1回かそれ以上の一連のゲームをプレイする.
 * それぞれのゲームではプレイするのに m ポンドのコストがかかり, 最初の賭け金は1ボンドからスタートする.
 * 博打打ちは偏りのないコインを1個投げる.
 * 表が出るたびに賭け金は2倍となり, 博打打ちはゲームを続ける.
 * 裏が出たら, ゲームは終了し博打打ちはその時点の賭け金を受け取る.
 * 博打打ちは少なくとも, ゲームの初期費用である m ポンドのコストを賭けて, 開始時の賭け金である1ポンドを必ず手に入れることができる.
 * もし博打打ちの手持ちの財産が m ポンド以下となると, プレイし続けることができなくなる.
 * 博打打ちの持っている財産を s, ゲームごとのコストを m とした時, この賭けでお金を使い果たす(訳注: ここでは手持ちの財産が m
 * ポンド以下になりゲームを続けられなくなることを指す. フォーラム参照のこと.)ことのない場合の確率を p&sub{m};(s) と表そう.
 * 例として, p&sub{2};(2) = 0.2522, p&sub{2};(5) = 0.6873, そして p&sub{6};(10 000)
 * = 0.9952 (注記: s < m のとき, p&sub{m};(s) = 0).
 * p&sub{15};(10&sup{9};)を求め, 回答を小数点以下7桁までとなるよう四捨五入し 0.abcdefg の形式で答えよ.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <stdbool.h>

int main() {
    printf("Project Euler - Problem 499\n");
    
    // TODO: Implement solution here
    
    return 0;
}
